import sys
sys.stdin = open('input.txt')

'''

# 9까지  : 45 * 1
# 19까지 : 45 * 1 * 2 + 10
# 99까지 : 45 * 10 * 2 
# 199까지 : 45 * 10 * 2 * 2 + 100
# 299까지 : 45 * 10 * 2 * 3 + 100 + 100 * 2
# 399까지 : 45 * 10 * 2 * 4 + 100 + 100 * 2 + 100 * 3
# 499까지 : 45 * 10 * 2 * 5 + 100 + 100 * 2 + 100 * 3 + 100 * 4
# 999까지 : 45 * 100 * 3

# 9999까지 : 45 * 1000 * 4
'''
'''
1부터 n까지 합계를 공식화하자!

# 십의 자리 : 1 * 10 + 2 * 10 + 3 * 10 + 4 * 6 = 84
# 일의 자리 : 45 * 4 + 5(5+1)/2 = 195
'''

import sys
min, max = map(int,sys.stdin.readline().split())
sum=0
for i in range(min,max+1):
  for j in str(i):
    sum +=int(j)
print(sum)

